# словники:
#
# 1. Наведено список країн і міст кожної країни. Для кожного міста вкажіть, в якій країні воно знаходиться.
# 2. Дано два списки однакової довжини. Необхідно створити з них словник таким чином, щоб елементи першого списку були ключами, а елементи другого відповідно значеннями нашого словника.

contry = {
  "Україна": ["Київ", "Львів", "Дніпро"],
  "США": ["Лос-Анджелес", "Лас-Вегас"],
  "Франція": ["Париж", "Ліон"],
  "Німеччина": ["Берлін", "Мюнхен"],
  "Китай": ["Пекін", "Шанхай", "Гуанчжоу"],
  "Іспанія": ["Мадрид", "Барселона"],
  "Італія": ["Рим", "Мілан"],
}

print(contry["США"])


user_first_list = ["name", "country", "time"]
user_second_list = ["Ivan", "Ukraine", "+3"]
user_dict = {}
for i in range(len(user_first_list)):
    keys = user_first_list[i]
    names = user_second_list[i]
    user_dict[keys] = names
print(user_dict)
print(user_dict["name"])

# 1. Створити список чисел. Заберіть дублікати значень. Вивести унікальні значення.

text = [1, 2, 3, 2, 4, 5, 5, 6, 1]
speceal_text = []

for i in text:
    if i not in speceal_text:
        speceal_text.append(i)
print(speceal_text)
# 2. Дано два списки чисел.
# Порахуйте, скільки чисел міститься як у першому списку, і у другому.
text1 = [1, 2, 3, 2, 4, 5, 5, 6, 1]
text2 = [3, 9, 5, 5, 32, 2, 7]
print(len(text1))
print(len(text2))

# 3. Даний текст: у першому рядку записано число рядків, далі йдуть самі рядки.
#
# Визначте, скільки різних слів міститься у цьому тексті.
#
#
#
# Словом вважається послідовність непробільних символів, що йдуть поспіль, слова розділені одним або більшим числом пробілів або символами кінця рядка.

